[
  {
    "title": "Scalar damping in cosmological phase transitions",
    "summary": "We outline how to calculate the scalar damping term during a cosmological phase transition from kinetic theory. We determine the scalar damping rate from top quarks and weak gauge bosons in a Standard Model-like theory. We find that the convergence of the bosonic contributions hinges on how the soft modes are treated. We discuss the validity of the phenomenological friction term employed in hydrodynamical simulations. We find that for a Standard Model particle content, this approximation is (marginally) justified.   We also test the hypothesis that the pressure from a runaway wall acts as an upper bound on the pressure from the local friction term. We find that next-to-leading order contributions in terms of velocity and mass are negative and that in the regime of validity, the local damping term indeed cannot surpass the pressure from runaway bubbles.",
    "published": "2025-12-18T15:31:33Z",
    "link": "http://arxiv.org/abs/2512.16663v1"
  },
  {
    "title": "Cosmology with non-linear barotropic Israel-Stewart fluid with causal relaxation time",
    "summary": "We derive an extended expression for the relaxation time of a barotropic Israel-Stewart (IS) fluid using the non-linear causality constraint, and propose a new formulation for modeling causal viscous dissipation in barotropic fluids. With this generalized relaxation time, the non-linear IS equation simplifies to a first-order non-linear expression connecting bulk viscous pressure and energy density, which remains valid in any homogeneous and isotropic spacetime. In the case of spatially flat Friedmann universe, adopting this extended relation in the generalized non-linear IS theory, provides new class of analytical solutions in both, the linear, and the non-linear regimes. We also find that, the resulting effective equation of state in the linear regime naturally reproduces the generalized polytropic form which is often introduced phenomenologically in literature. Resulting dynamical implications are investigated and the constraints necessary for ensuring an acceptable evolutionary behavior for the fluid are determined. A detailed dynamical system analysis of the coupled Einstein-Israel-Stewart (EIS) system is also performed. Finally, we solve the coupled EIS equations numerically, and show that the model can support a transient Hubble slow-roll expansion phase with a smooth exit to a radiation-dominated universe, which is challenging to obtain in standard inflationary models.",
    "published": "2025-12-18T13:12:34Z",
    "link": "http://arxiv.org/abs/2512.16502v1"
  },
  {
    "title": "Uniform Rolling: An LSST Observing Cadence Offering Sufficient Survey Uniformity for Comprehensive Cosmological Analysis",
    "summary": "The Legacy Survey of Space and Time (LSST) that will be carried out by the NSF-DOE Vera C. Rubin Observatory promises to be the defining survey of the next decade, supplying unprecedented access to the night sky to static science- and time-domain science-focused researchers alike. Maximizing the output of the broad remit of Rubin Observatory science requires a non-trivial survey strategy. For time-domain science, the most promising strategy designed so far is a rolling survey strategy, whereby a subset of the full LSST survey area is observed at higher rate compared with the nominal rate dictated by weather conditions and the observatory's technical constraints. This strategy is now the baseline approach for the LSST as a whole. Focusing on static science (galaxy clustering and weak lensing), we study how these time-domain-optimized rolling strategies affect the depth uniformity at intermediate years of the survey. We characterize the amount of survey area at high risk of being lost in static-science analyses of a baseline rolling LSST dataset due to an insufficient combination of survey contiguity and uniformity. At intermediate data releases, nearly half of the survey could be lost for static science, decreasing the Dark Energy figure of merit by approximately 40\\%. We describe additional metrics focused on key analysis tasks, such as photometric redshifts and galaxy clustering. We propose a new strategy that returns the survey to uniformity at key release years, enabling use of the full survey area and restoring our metrics to the values they would have in a non-rolling cadence without loss of time domain data relative to a rolling survey with the same number of rolling cycles. This work has informed the third round of optimization of the survey strategy, and the new uniform rolling strategies have been incorporated into the baseline strategy.",
    "published": "2025-12-18T12:49:23Z",
    "link": "http://arxiv.org/abs/2512.16478v1"
  },
  {
    "title": "Quantum Liouville Cosmology",
    "summary": "We provide a detailed analysis of the disk path integral of timelike Liouville theory, conceived as a tractable and precise toy-model quantum cosmology in two dimensions. Disk path integrals with the insertion of matter field operators, taken along a judiciously chosen complex contour, yield states akin to the Hartle-Hawking wavefunction. Working in the fixed $K$-representation, where $K$ is the trace of the extrinsic curvature, we compute the one-loop wavefunctions and put forward a conjecture for the all-loop expressions. A suitable pairing of Liouville disk path integrals yields a $K$-independent quantity that may form the basis for a well-defined inner product on the space of Euclidean histories. We also consider other ensembles, including one with fixed area, and provide a static patch perspective with a timelike feature.",
    "published": "2025-12-17T20:58:05Z",
    "link": "http://arxiv.org/abs/2512.15969v1"
  },
  {
    "title": "Cosmological Constraints from Full-Scale Clustering and Galaxy-Galaxy Lensing with DESI DR1",
    "summary": "We present constraints on cosmic structure growth from the analysis of galaxy clustering and galaxy-galaxy lensing with galaxies from the Dark Energy Spectroscopic Instrument (DESI) Data Release 1. We analyze four samples drawn from the Bright Galaxy Survey (BGS) and the Luminous Red Galaxy (LRG) target classes. Projected galaxy clustering measurements from DESI are supplemented with lensing measurements from the Dark Energy Survey (DES), the Kilo-Degree Survey (KiDS), and the Hyper Suprime-Cam (HSC) survey around the same targets. Our method relies on a simulation-based modeling framework using the AbacusSummit simulations and a complex halo occupation distribution model that incorporates assembly bias. We analyze scales down to $0.4 \\, h^{-1} \\, \\mathrm{Mpc}$ for clustering and $2.5 \\, h^{-1} \\, \\mathrm{Mpc}$ for lensing, leading to stringent constraints on $S_8 = σ_8 \\sqrt{Ω_\\mathrm{m} / 0.3}$ and $Ω_\\mathrm{m}$ when fixing other cosmological parameters to those preferred by the CMB. We find $S_8 = 0.794 \\pm 0.023$ and $Ω_\\mathrm{m} = 0.295 \\pm 0.012$ when using lensing measurements from DES and KiDS. Similarly, for HSC, we find $S_8 = 0.793 \\pm 0.017$ and $Ω_\\mathrm{m} = 0.303 \\pm 0.010$ when assuming the best-fit photometric redshift offset suggested by the HSC collaboration. Overall, our results are in good agreement with other results in the literature while continuing to highlight the constraining power of non-linear scales.",
    "published": "2025-12-17T20:47:40Z",
    "link": "http://arxiv.org/abs/2512.15962v1"
  },
  {
    "title": "Joint cosmological fits to DESI-DR1 full-shape clustering and weak gravitational lensing in configuration space",
    "summary": "We present a joint $3\\times2$-pt cosmological analysis of auto- and cross-correlations between the Dark Energy Spectroscopic Instrument Data Release 1 (DESI-DR1) Bright Galaxy Survey (BGS) and Luminous Red Galaxy (LRG) samples and overlapping shear measurements from the KiDS-1000, DES-Y3 and HSC-Y3 weak lensing surveys. We perform our analysis in configuration space and, in addition to the cosmic shear correlation functions for each weak lensing dataset, we fit the tangential shear of the weak lensing source galaxies around DESI lens galaxies. Finally, we make use of the anisotropic BGS and LRG clustering information by fitting the full shape of the two-point correlation function multipoles measured over the full DESI-DR1 footprint, presenting the first full-shape analysis of DESI measurements in configuration space. We find that the addition of weak lensing information serves to improve, with respect to the clustering-only case, the measurements of the power spectrum amplitude parameters $\\ln(10^{10}A_{\\rm{s}})$ and $σ_{12}$ by $15\\%$ and $36\\%$, respectively. It also improves measurements of the linear bias of the lens galaxies by $15-20\\%$, depending on the tracer. Our results show excellent consistency, regardless of the weak lensing survey considered, and are furthermore consistent with a companion analysis that fits $3\\times2$-pt correlations including DESI projected clustering measurements, as well as the results published by the weak lensing collaborations themselves. Our measured values for weak lensing amplitude are $S_{8}^{\\mathrm{DESI\\times HSC}}=0.787\\pm0.020$, $S_{8}^{\\mathrm{DESI\\times DES}}=0.791\\pm0.016$, $S_{8}^{\\mathrm{DESI\\times KiDS}}=0.771\\pm0.017$, which are $1.9σ-2.9σ$ below the $S_8$ value preferred by Planck. Finally, our clustering-only results are in good agreement with the Fourier space full-shape analysis of all DESI tracers.",
    "published": "2025-12-17T20:47:39Z",
    "link": "http://arxiv.org/abs/2512.15961v1"
  },
  {
    "title": "DESI-DR1 $3 \\times 2$-pt analysis: consistent cosmology across weak lensing surveys",
    "summary": "We present a joint cosmological analysis of projected galaxy clustering observations from the Dark Energy Spectroscopic Instrument Data Release 1 (DESI-DR1), and overlapping weak gravitational lensing observations from three datasets: the Kilo-Degree Survey (KiDS-1000), the Dark Energy Survey (DES-Y3), and the Hyper-Suprime-Cam Survey (HSC-Y3). This combination of large-scale structure probes allows us to measure a set of $3 \\times 2$-pt correlation functions, breaking the degeneracies between parameters in cosmological fits to individual observables. We obtain mutually-consistent constraints on the parameter $S_8 = σ_8 \\sqrt{Ω_{\\rm m}/0.3} = 0.786^{+0.022}_{-0.019}$ from the combination of DESI-DR1 and DES-Y3, $S_8 = 0.760^{+0.020}_{-0.018}$ from KiDS-1000, and $S_8 = 0.771^{+0.026}_{-0.027}$ from HSC-Y3. These parameter determinations are consistent with fits to the Planck Cosmic Microwave Background dataset, albeit with $1.5-2σ$ lower values in the $S_8-Ω_{\\rm m}$ plane. We perform our analysis with a unified pipeline tailored to the requirements of each cosmic shear survey, which self-consistently determines cosmological and astrophysical parameters. We generate an analytical covariance matrix for the correlation data including all cross-covariances between probes, and we design a new blinding procedure to safeguard our analysis against confirmation bias, whilst leaving goodness-of-fit statistics unchanged. Our study is part of a suite of papers that present joint cosmological analyses of DESI-DR1 and weak gravitational lensing datasets.",
    "published": "2025-12-17T20:47:38Z",
    "link": "http://arxiv.org/abs/2512.15960v1"
  },
  {
    "title": "Fifty shades of grayness: parameterizations of spectral distortions and applications in cosmology",
    "summary": "Thermal distribution functions can only be of the Fermi-Dirac or Bose-Einstein types, whereas distorted spectra encompass any possible deviations from these shapes. It is fruitful to devise parameterizations of these distortions with only a few parameters which depend on the physical system considered. A method proposed by Stebbins consists in describing a distorted spectrum as a sum of thermalized spectra with a distribution of temperatures, the moments of which are the parameters of interest. After revisiting and extending this approach by working at the level of the number density distribution instead of the standard spectrum, we build another method which consists in describing the distorted spectrum by a polynomial modulating a reference thermalized spectrum. The distortion parameters are then the coefficients of a decomposition on a suitable orthonormal polynomial basis. We advocate that the latter is computationally easier and allows to describe a wide range of distortions. With this formalism, we efficiently describe the standard distortions of the cosmological backgrounds of neutrinos and photons, and we obtain model-independent constraints on nonstandard distortions of these cosmological relics.",
    "published": "2025-12-17T19:05:51Z",
    "link": "http://arxiv.org/abs/2512.15893v1"
  },
  {
    "title": "Cosmological Neutron Stars Produce Diffuse Axion X-Ray Signatures",
    "summary": "Axion-like particles can be abundantly produced through scattering processes in the cores of neutron stars (NSs). If they are ultralight ($m_a \\lesssim 10^{-4}$ eV), then they can efficiently convert to detectable photons in the external NS magnetospheres, and if they are heavy ($m_a \\gtrsim 1$ eV), then they can decay into photons before reaching Earth. In this work, we search for the resulting X-ray signatures from both of these channels summing over the $\\textit{cosmological}$ NS population. We compare the predicted axion-induced X-ray signal to the cosmic X-ray background today as measured by a number of instruments such as NuSTAR, HEAO, Swift, and INTEGRAL. We model the axion-induced signal using NS cooling simulations and magnetic field evolution models. We find no evidence for axions and derive strong constraints for both ultralight and heavy axion scenarios, covering new parameter space for the axion-photon and axion-nucleon couplings. Our results rule out the axion-explanation of the Magnificent Seven X-ray excess from nearby isolated NSs.",
    "published": "2025-12-17T19:00:00Z",
    "link": "http://arxiv.org/abs/2512.15849v1"
  },
  {
    "title": "Beyond Stage IV: Quasar and Galaxy Clustering and the Fundamental Physics of the 2040s",
    "summary": "Stage IV galaxy surveys (DESI, 4MOST, MOONS, Euclid) are establishing precision constraints on cosmological parameters through baryon acoustic oscillations and redshift-space distortions, yet fundamental questions on neutrino masses, inflationary physics, and the nature of gravity remain beyond their reach. We present a science case for next-generation wide-field spectroscopic surveys targeting $1 < z < 6$ with simultaneous observations of thousands of galaxies, quasars, and emission-line galaxies. Such surveys would deliver transformative advances: (i) cosmological constraints on absolute neutrino masses ($Σm_ν\\lesssim 0.015\\,\\mathrm{eV}$), three times more stringent than Stage IV, enabling resolution of the neutrino mass hierarchy; (ii) detection of primordial non-Gaussianity at the level of $f_{\\mathrm{NL}} \\sim 1$, probing multi-field inflation; (iii) measurements of structure growth $fσ_8(z)$ spanning cosmic time to constrain dark energy and test gravitational modifications. Achieving these goals requires revolutionary advances in spectroscopic multiplexing ($\\mathcal{O}(1000)$ simultaneous spectra), sub-$2\\times10^{-4}(1+z)$ redshift precision at scale, and field-level inference techniques exploiting higher-order clustering statistics. We demonstrate that the proposed Wide-field Spectroscopic Telescope concept provides a technically feasible and scientifically compelling path to unlock the physics of neutrinos, inflation, and gravity that will remain inaccessible to Stage IV surveys.",
    "published": "2025-12-17T10:45:12Z",
    "link": "http://arxiv.org/abs/2512.15294v1"
  }
]