[
  {
    "title": "Many-body contextuality and self-testing quantum matter via nonlocal games",
    "summary": "Contextuality is arguably the fundamental property that makes quantum mechanics different from classical physics. It is responsible for quantum computational speedups in both magic-state-injection-based and measurement-based models of computation, and can be directly probed in a many-body setting by multiplayer nonlocal quantum games. Here, we discuss a family of games that can be won with certainty when performing single-site Pauli measurements on a state that is a codeword of a Calderbank-Shor-Steane (CSS) error-correcting quantum code. We show that these games require deterministic computation of a code-dependent Boolean function, and that the classical probability of success is upper bounded by a generalized notion of nonlinearity/nonquadraticity. This success probability quantifies the state's contextuality, and is computed via the function's (generalized) Walsh-Hadamard spectrum. To calculate this, we introduce an efficient, many-body-physics-inspired method that involves identifying the symmetries of an auxiliary hypergraph state. We compute the classical probability of success for several paradigmatic CSS codes and relate it to both classical statistical mechanics models and to strange correlators of symmetry-protected topological states. We also consider CSS submeasurement games, which can only be won with certainty by sharing the appropriate codeword up to local isometries. These games therefore enable self-testing, which we illustrate explicitly for the 2D toric code. We also discuss how submeasurement games enable an extensive notion of contextuality in many-body states.",
    "published": "2025-12-18T18:50:09Z",
    "link": "http://arxiv.org/abs/2512.16886v1"
  },
  {
    "title": "Advantage of Warm Starts for Electron-Phonon Systems on Quantum Computers",
    "summary": "Simulating electron-phonon interactions on quantum computers remains challenging, with most algorithmic effort focused on Hamiltonian simulation and circuit optimization. In this work, we study the single-electron Holstein model and propose an initial-state ansatz that substantially enhances ground state overlap in the strong coupling regime, thereby reducing the number of iterations required in standard quantum phase estimation. We further show that this ansatz can be implemented efficiently and yields an exponential reduction in overall circuit costs relative to conventional initial guesses. Our results highlight the practical value of incorporating physical intuition into initial state preparation for electron-phonon coupled systems.",
    "published": "2025-12-18T18:48:26Z",
    "link": "http://arxiv.org/abs/2512.16879v1"
  },
  {
    "title": "Signatures of real-space geometry, topology, and metric tensor in quantum transport in periodically corrugated spaces",
    "summary": "The motion of a quantum particle constrained to a two-dimensional non-compact Riemannian manifold with non-trivial metric can be described by a flat-space Schroedinger-type equation at the cost of introducing local mass and metric and geometry-induced effective potential with no classical counterpart. For a metric tensor periodically modulated along one dimension, the formation of bands is demonstrated and transport-related quantities are derived. Using S-matrix approach, the quantum conductance along the manifold is calculated and contrasted with conventional quantum transport methods in flat spaces. The topology, e.g. whether the manifold is simply connected, compact or non-compact shows up in global, non-local properties such as the Aharonov-Bohm phase. The results vividly demonstrate emergent phenomena due to the interplay of reduced-dimensionality, particles quantum nature, geometry, and topology.",
    "published": "2025-12-18T18:21:10Z",
    "link": "http://arxiv.org/abs/2512.16846v1"
  },
  {
    "title": "On Quivers Satisfying Quantum Yang-Baxter Equation, and Hecke Condition",
    "summary": "In this paper we initiate the study of quivers satisfying quantum Yang-Baxter equation. By considering quivers with quantum group like relations such as quantum Yang-Baxter equation, Hecke condition, we follow RTT construction to produce examples of Leavitt path algebras that contain quantum matrix algebra as subalgebra. Furthermore, we show that the quantum Yang-Baxter equation, and Hecke condition for our RTT construction can be generated intrinsically from the adjacency matrix of certain quivers.",
    "published": "2025-12-18T18:05:26Z",
    "link": "http://arxiv.org/abs/2512.16825v1"
  },
  {
    "title": "Numerically exact open quantum system work statistics with process tensors",
    "summary": "Accurately quantifying the thermodynamic work costs of quantum operations is essential for the continued development and optimisation of emerging quantum technologies. This present a significant challenge in regimes of rapid control within complex, non-equilibrium environments - conditions under which many contemporary quantum devices operate and conventional approximations break down. Here, we introduce a process tensor framework that enables the computation of the full numerically exact quantum work statistics of driven open quantum systems. We demonstrate the utility of our approach by applying it to a Landauer erasure protocol operating beyond the weak-coupling, Markovian, and slow-driving limits. The resulting work probability distributions reveal distinct quantum signatures that are missed by low-order moments yet significantly impact the erasure fidelity of the protocol. Our framework delivers non-perturbative accuracy and detail in characterising energy-exchange fluctuations in driven open quantum systems, establishing a powerful and versatile tool for exploring thermodynamics and control in the operating regimes of both near-term and future quantum devices.",
    "published": "2025-12-18T18:04:18Z",
    "link": "http://arxiv.org/abs/2512.16823v1"
  },
  {
    "title": "Non-Linear Strong Data-Processing for Quantum Hockey-Stick Divergences",
    "summary": "Data-processing is a desired property of classical and quantum divergences and information measures. In information theory, the contraction coefficient measures how much the distinguishability of quantum states decreases when they are transmitted through a quantum channel, establishing linear strong data-processing inequalities (SDPI). However, these linear SDPI are not always tight and can be improved in most of the cases. In this work, we establish non-linear SDPI for quantum hockey-stick divergence for noisy channels that satisfy a certain noise criterion. We also note that our results improve upon existing linear SDPI for quantum hockey-stick divergences and also non-linear SDPI for classical hockey-stick divergence. We define $F_γ$ curves generalizing Dobrushin curves for the quantum setting while characterizing SDPI for the sequential composition of heterogeneous channels. In addition, we derive reverse-Pinsker type inequalities for $f$-divergences with additional constraints on hockey-stick divergences. We show that these non-linear SDPI can establish tighter finite mixing times that cannot be achieved through linear SDPI. Furthermore, we find applications of these in establishing stronger privacy guarantees for the composition of sequential private quantum channels when privacy is quantified by quantum local differential privacy.",
    "published": "2025-12-18T17:10:22Z",
    "link": "http://arxiv.org/abs/2512.16778v1"
  },
  {
    "title": "Reconstruction of Quantum Fields",
    "summary": "One of the traditional ways of introducing bosons and fermions is through creation and annihilation algebras. Historically, these have been associated with emission and absorption processes at the quantum level and are characteristic of the language of second quantization. In this work, we formulate the transition from first to second quantization by taking quotients of the state spaces of distinguishable particles, so that the resulting equivalence classes identify states that contain no information capable of distinguishing between particles, thereby generalising the usual symmetrisation procedure. Assuming that the resulting indistinguishable-particle space (i) admits an ordered basis compatible with how an observer may label the accessible modes, (ii) is invariant under unitary transformations of those modes, and (iii) supports particle counting as a mode-wise local operation, we derive a new class of creation-annihilation algebras. These algebras reproduce the partition functions of transtatistics-maximal generalisations of bosons and fermions consistent with these operational principles.",
    "published": "2025-12-18T17:07:25Z",
    "link": "http://arxiv.org/abs/2512.16775v1"
  },
  {
    "title": "QuantumSavory: Write Symbolically, Run on Any Backend -- A Unified Simulation Toolkit for Quantum Computing and Networking",
    "summary": "Progress in quantum computing and networking depends on codesign across abstraction layers: device-level noise and heterogeneous hardware, algorithmic structure, and distributed classical control. We present QuantumSavory, an open-source toolkit built to make such end-to-end studies practical by cleanly separating a symbolic computer-algebra frontend from interchangeable numerical simulation backends. States, operations, measurements, and protocol logic are expressed in a backend-agnostic symbolic language; the same model can be executed across multiple backends (e.g., stabilizer, wavefunction, phase-space), enabling rapid exploration of accuracy-performance tradeoffs without rewriting the model. Furthermore, new custom backends can be added via a small, well-defined interface that immediately reuses existing models and protocols.   QuantumSavory also addresses the classical-quantum interaction inherent to LOCC protocols via discrete-event execution and a tag/query system for coordination. Tags attach structured classical metadata to quantum registers and message buffers, and queries retrieve, filter, or wait on matching metadata by wildcards or arbitrary predicates. This yields a data-driven control plane where protocol components coordinate by publishing and consuming semantic facts (e.g., resource availability, pairing relationships, protocol outcomes) rather than by maintaining rigid object graphs or bespoke message plumbing, improving composability and reuse as models grow. Our toolkit is also not limited to qubits and Bell pairs; rather, any networking dynamics of any quantum system under any type of multipartite entanglement can be tackled. Lastly, QuantumSavory ships reusable libraries of standard states, circuits, and protocol building blocks with consistent interfaces, enabling full-stack examples to be assembled, modified, and compared with minimal glue code.",
    "published": "2025-12-18T16:48:49Z",
    "link": "http://arxiv.org/abs/2512.16752v1"
  },
  {
    "title": "QMCkl: A Kernel Library for Quantum Monte Carlo Applications",
    "summary": "Quantum Monte Carlo (QMC) methods deliver highly accurate electronic structure calculations but are computationally intensive. The quantum Monte Carlo kernel library (QMCkl) provides a modular, portable collection of high-performance kernels implementing the core building blocks of QMC calculations. It offers a C-compatible API, supports the TREXIO standard for input, and covers essential QMC kernels including atomic and molecular orbitals, cusp corrections, Jastrow factor, and the necessary derivatives also to perform variational and structural optimization. QMCkl separates algorithmic development from hardware-specific tuning by combining human-readable reference implementations with performance-optimized kernels that produce identical numerical results. The library enables consistent, efficient, and reproducible simulations across different QMC codes and architectures, and achieves substantial speedups in the evaluation of the energy and its derivatives. Beyond QMC, QMCkl can accelerate deterministic quantum chemistry workflows and visualization tools, promoting cross-code interoperability and simplifying high-performance scientific software development.",
    "published": "2025-12-18T15:47:20Z",
    "link": "http://arxiv.org/abs/2512.16677v1"
  },
  {
    "title": "Symbolic Pauli Propagation for Gradient-Enabled Pre-Training of Quantum Circuits",
    "summary": "Quantum Machine Learning models typically require expensive on-chip training procedures and often lack efficient gradient estimation methods. By employing Pauli propagation, it is possible to derive a symbolic representation of observables as analytic functions of a circuit's parameters. Although the number of terms in such functional representations grows rapidly with circuit depth, suitable choices of ansatz and controlled truncations on Pauli weights and frequency components yield accurate yet tractable estimators of the target observables. With the right ansatz design, this approach can be extended to system sizes beyond the reach of classical simulation, enabling scalable training for larger quantum systems. This also enables a form of classical pre-training through gradient-based optimization prior to deployment on quantum hardware. The proposed approach is demonstrated on the Variational Quantum Eigensolver for obtaining the ground state of a spin model, showing that accurate results can be achieved with a scalable and computationally efficient procedure.",
    "published": "2025-12-18T15:44:07Z",
    "link": "http://arxiv.org/abs/2512.16674v1"
  }
]