[
  {
    "title": "The Social Responsibility Stack: A Control-Theoretic Architecture for Governing Socio-Technical AI",
    "summary": "Artificial intelligence systems are increasingly deployed in domains that shape human behaviour, institutional decision-making, and societal outcomes. Existing responsible AI and governance efforts provide important normative principles but often lack enforceable engineering mechanisms that operate throughout the system lifecycle. This paper introduces the Social Responsibility Stack (SRS), a six-layer architectural framework that embeds societal values into AI systems as explicit constraints, safeguards, behavioural interfaces, auditing mechanisms, and governance processes. SRS models responsibility as a closed-loop supervisory control problem over socio-technical systems, integrating design-time safeguards with runtime monitoring and institutional oversight. We develop a unified constraint-based formulation, introduce safety-envelope and feedback interpretations, and show how fairness, autonomy, cognitive burden, and explanation quality can be continuously monitored and enforced. Case studies in clinical decision support, cooperative autonomous vehicles, and public-sector systems illustrate how SRS translates normative objectives into actionable engineering and operational controls. The framework bridges ethics, control theory, and AI governance, providing a practical foundation for accountable, adaptive, and auditable socio-technical AI systems.",
    "published": "2025-12-18T18:42:16Z",
    "link": "http://arxiv.org/abs/2512.16873v1"
  },
  {
    "title": "Meta-RL Induces Exploration in Language Agents",
    "summary": "Reinforcement learning (RL) has enabled the training of large language model (LLM) agents to interact with the environment and to solve multi-turn long-horizon tasks. However, the RL-trained agents often struggle in tasks that require active exploration and fail to efficiently adapt from trial-and-error experiences. In this paper, we present LaMer, a general Meta-RL framework that enables LLM agents to actively explore and learn from the environment feedback at test time. LaMer consists of two key components: (i) a cross-episode training framework to encourage exploration and long-term rewards optimization; and (ii) in-context policy adaptation via reflection, allowing the agent to adapt their policy from task feedback signal without gradient update. Experiments across diverse environments show that LaMer significantly improves performance over RL baselines, with 11%, 14%, and 19% performance gains on Sokoban, MineSweeper and Webshop, respectively. Moreover, LaMer also demonstrates better generalization to more challenging or previously unseen tasks compared to the RL-trained agents. Overall, our results demonstrate that Meta-RL provides a principled approach to induce exploration in language agents, enabling more robust adaptation to novel environments through learned exploration strategies.",
    "published": "2025-12-18T18:22:17Z",
    "link": "http://arxiv.org/abs/2512.16848v1"
  },
  {
    "title": "Enhancing Kinematics Understanding Through a Real-Time Graph-Based Motion Video Game",
    "summary": "Kinematics is a core topic in early physics courses, yet students often struggle to interpret motion and its graphical representations. To tackle these difficulties, we developed MissionMotion, a physical-computational videogame where students reproduce target motion graphs using real-time data from their own movements or from sensors connected through micro:bit or Arduino. The system displays both the target and the user-generated graph, providing immediate visual feedback and a score based on similarity. We piloted the environment with ninth-grade students in different school contexts and evaluated their experience using the MEEGA+ instrument. The results show strong engagement, positive perceptions of usability, and evidence that the game promotes reflection on motion graphs in ways that rarely emerge in traditional lessons. MissionMotion runs on any web-enabled device and all materials are openly available, offering teachers an accessible tool to integrate experimentation, computational thinking, and playful learning into physics classrooms.",
    "published": "2025-12-18T18:14:44Z",
    "link": "http://arxiv.org/abs/2512.16838v1"
  },
  {
    "title": "A parallel, pipeline-based online analysis system for Interaction Vertex Imaging",
    "summary": "Objective   Interaction vertex imaging (IVI) is used for range monitoring in carbon ion radiotherapy, detecting depth differences between Bragg peak positions. Online range monitoring, which provides feedback during beam delivery, is particularly desirable, creating an opportunity to detect range errors before the treatment fraction is completed. Incorporating online range monitoring into clinical workflows may therefore improve the safety and consistency of radiotherapy.   Approach   The data analysis system was broken into a task-parallel pipeline approach, to allow multiple analysis stages to occur concurrently, beginning during acquisition. Computationally-expensive operations were further parallelized to reduce bottleneck effects. Data collected from irradiation of homogeneous plastic phantoms was replayed at the same rate it was initially acquired, to mimic data acquisition, and the time required to determine a range shift was measured.   Main Results   With an optimized pipeline, the delay between the end of irradiation and the determination of a range shift is consistently less than 200 ms. The majority of this time is associated with the final range shift determination, with a minor effect from the time required to analyze the last data packet. The most significant contribution to an optimized analysis workflow is the formation of clusters, requiring almost 50% of compute time.   Significance   This system is the first IVI implementation to achieve clinically-relevant online analysis times. The 200 ms time required to determine a range shift is less than the time required to accelerate a new spill in a synchrotron, and is comparable to the time required for reacceleration if multiple energies are delivered in the same spill. Clinical implementation of online range monitoring would allow treatment to be quickly paused or aborted if significant range errors are detected.",
    "published": "2025-12-18T17:32:01Z",
    "link": "http://arxiv.org/abs/2512.16800v1"
  },
  {
    "title": "Model-Based Real-Time Synthesis of Acousto-Optically Generated Laser-Beam Patterns and Tweezer Arrays",
    "summary": "Acousto-optic deflectors (AOD) enable spatiotemporal control of laser beams through diffraction at an ultrasonic grating that is controllable by radio-frequency (rf) waveforms. These devices are a widely used tool for high-bandwidth random-access scanning applications, such as optical tweezers in quantum technology. A single AOD can generate multiple optical tweezers by multitone rf input in one dimension. Two-dimensional (2D) patterns can be realized with two perpendicularly oriented AODs. As the acousto-optical response depends nonlinearly on the applied frequency components, phases, and amplitudes, and in addition experiences dimensional coupling in 2D setups, intensity regulation becomes a unique challenge. Guided by coupled-wave theory and experimental observations, we derive a compute-efficient model which we implement on a graphics processing unit. Only one-time sampling of single-tone laser-power calibration is needed for model parameter determination, allowing for straight-forward integration into optical instruments. We implement and experimentally validate an open-loop diffraction efficiency control system that enables programmable 2D multibeam trajectories with intensity control applied at every time step during digital signal generation, overcoming the limited flexibility, pattern-size constraints, and bandwidth limitations of methods using precalculation and precalibration of a predefined pattern set or closed-loop feedback. The system is capable of stable real-time waveform streaming of arrays with up to 50 x 50 tweezers with minimal time resolution of 1.4 ns (700 MS/s) and a peak latency below 257 microseconds for execution of newly requested patterns. Reactive, real-time 2D multibeam laser patterning and scanning with strict intensity matching will substantially benefit parallelization and increasing data rates in materials processing, microscopy, and optical tweezers.",
    "published": "2025-12-18T17:07:01Z",
    "link": "http://arxiv.org/abs/2512.16774v1"
  },
  {
    "title": "Task-Oriented Data Synthesis and Control-Rectify Sampling for Remote Sensing Semantic Segmentation",
    "summary": "With the rapid progress of controllable generation, training data synthesis has become a promising way to expand labeled datasets and alleviate manual annotation in remote sensing (RS). However, the complexity of semantic mask control and the uncertainty of sampling quality often limit the utility of synthetic data in downstream semantic segmentation tasks. To address these challenges, we propose a task-oriented data synthesis framework (TODSynth), including a Multimodal Diffusion Transformer (MM-DiT) with unified triple attention and a plug-and-play sampling strategy guided by task feedback. Built upon the powerful DiT-based generative foundation model, we systematically evaluate different control schemes, showing that a text-image-mask joint attention scheme combined with full fine-tuning of the image and mask branches significantly enhances the effectiveness of RS semantic segmentation data synthesis, particularly in few-shot and complex-scene scenarios. Furthermore, we propose a control-rectify flow matching (CRFM) method, which dynamically adjusts sampling directions guided by semantic loss during the early high-plasticity stage, mitigating the instability of generated images and bridging the gap between synthetic data and downstream segmentation tasks. Extensive experiments demonstrate that our approach consistently outperforms state-of-the-art controllable generation methods, producing more stable and task-oriented synthetic data for RS semantic segmentation.",
    "published": "2025-12-18T16:37:39Z",
    "link": "http://arxiv.org/abs/2512.16740v1"
  },
  {
    "title": "Observer-based Differentially Private Consensus for Linear Multi-agent Systems",
    "summary": "This paper investigates the differentially private consensus problem for general linear multi-agent systems (MASs) based on output feedback protocols. To protect the output information, which is considered private data and may be at high risk of exposure, Laplace noise is added to the information exchange. The conditions for achieving mean square and almost sure consensus in observer-based MASs are established using the backstepping method and the convergence theory for nonnegative almost supermartingales. It is shown that the separation principle remains valid for the consensus problem of linear MASs with decaying Laplace noise. Furthermore, the convergence rate is provided. Then, a joint design framework is developed for state estimation gain, feedback control gain, and noise to ensure the preservation of ε-differential privacy. The output information of each agent is shown to be protected at every time step. Finally, sufficient conditions are established for simultaneously achieving consensus and preserving differential privacy for linear MASs utilizing both full-order and reduced-order observers. Meanwhile, an ε*-differentially private consensus is achieved to meet the desired privacy level. Two simulation examples are provided to validate the theoretical results.",
    "published": "2025-12-18T16:34:10Z",
    "link": "http://arxiv.org/abs/2512.16736v1"
  },
  {
    "title": "On the Origin of Kinematic Structure in the Young Association Serpens OB2",
    "summary": "The Serpens OB2 association (l ~ 18.5 deg, b ~ 1.9 deg, d = 1950 +/- 30 pc) is a large star-forming complex ~65 pc above the Galactic midplane, with a clumpy, elongated structure extending ~50 pc parallel to the plane. We analyse a sample of probable association members, including OB stars and low-to-intermediate-mass young stellar objects (YSOs) from the SPICY catalogue. While both populations are found throughout the association, the OB stars lie preferentially on the side nearest the Galactic plane, while the YSOs are generally younger and more strongly clustered around molecular-cloud clumps detected in 13CO MWISP data. Using Gaia DR3 proper motions to probe the association's internal kinematics, we find aligned stellar velocities on length scales <2 pc, two-point velocity statistics that show increasing velocity differences and predominantly divergent motions at larger separations, and distinct velocities for star clusters within the association. Finally, the association exhibits gradual, but statistically significant global expansion perpendicular to the Galactic plane, with a spatial gradient of 0.10 +/- 0.02 km/s/pc. The expansion of the H II region Sh 2-54, powered by the association's OB stars, may be accelerating the star-forming cloud away from the plane given the system's geometry, plausibly inducing the vertical stellar velocity gradient. The clumpy stellar distribution, correlated velocities on small scales, and increasingly divergent motions on larger scales are consistent with an initial velocity field inherited from a turbulent molecular cloud modified by stellar feedback. Ser OB2 demonstrates that the multi-scale expansion of an OB association can begin even while star formation is still ongoing throughout the complex.",
    "published": "2025-12-18T16:12:37Z",
    "link": "http://arxiv.org/abs/2512.16708v1"
  },
  {
    "title": "Inequality traps detected in sustainable development goals data",
    "summary": "The relationship between inequality and the biosphere has been hypothesized to mutual dependecies and feedbacks. If that is true, such feedbacks may give rise to inequality regimes and potential tipping points between them. Here we explore synergies and trade-offs between inequality and biosphere-related sustainable development goals. We used the openly available SDG datasets by the World Bank (WB) and United Nations (UN) and applied ordination methods to distill interactions between economic inequality and the environmental impact across countries. Our results confirm the existence of inequality regimes, and we find preliminary evidence that corruption may be a candidate driver of tipping between regimes.",
    "published": "2025-12-18T16:06:51Z",
    "link": "http://arxiv.org/abs/2512.16703v1"
  },
  {
    "title": "Deep learning directed synthesis of fluid ferroelectric materials",
    "summary": "Fluid ferroelectrics, a recently discovered class of liquid crystals that exhibit switchable, long-range polar order, offer opportunities in ultrafast electro-optic technologies, responsive soft matter, and next-generation energy materials. Yet their discovery has relied almost entirely on intuition and chance, limiting progress in the field. Here we develop and experimentally validate a deep-learning data-to-molecule pipeline that enables the targeted design and synthesis of new organic fluid ferroelectrics. We curate a comprehensive dataset of all known longitudinally polar liquid-crystal materials and train graph neural networks that predict ferroelectric behaviour with up to 95% accuracy and achieve root mean square errors as low as 11 K for transition temperatures. A graph variational autoencoder generates de novo molecular structures which are filtered using an ensemble of high-performing classifiers and regressors to identify candidates with predicted ferroelectric nematic behaviour and accessible transition temperatures. Integration with a computational retrosynthesis engine and a digitised chemical inventory further narrows the design space to a synthesis-ready longlist. 11 candidates were synthesised and characterized through established mixture-based extrapolation methods. From which extrapolated ferroelectric nematic transitions were compared against neural network predictions. The experimental verification of novel materials augments the original dataset with quality feedback data thus aiding future research. These results demonstrate a practical, closed-loop approach to discovering synthesizable fluid ferroelectrics, marking a step toward autonomous design of functional soft materials.",
    "published": "2025-12-18T15:41:29Z",
    "link": "http://arxiv.org/abs/2512.16671v1"
  }
]